configuration/src/Documents/ОбработкаЭскалацииОшибок/ОбработкаЭскалацииОшибок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОбработкаЭскалацииОшибок</name>
  <registerRecords>InformationRegister.ИсторияЭскалацииОшибок</registerRecords>
  <attributes>
    <name>Направление</name>
    <type>
      <types>CatalogRef.НаправленияРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектЭскалации</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </attributes>
  <attributes>
    <name>СерьезностьОшибки</name>
    <type>
      <types>CatalogRef.СерьезностьОшибок</types>
    </type>
  </attributes>
  <attributes>
    <name>Система</name>
    <type>
      <types>CatalogRef.СистемыУчета</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОчередьЭскалации</name>
    <attributes>
      <name>ИдентификаторОчереди</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаУведомления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусРеагирования</name>
      <type>
        <types>EnumRef.СтатусыОбработкиЭскалацииОшибок</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзмененияСтатуса</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Получатели</name>
    <attributes>
      <name>ИдентификаторОчереди</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>DefinedType.ПолучательОповещения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

configuration/src/InformationRegisters/ИсторияЭскалацииОшибок/ИсторияЭскалацииОшибок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияЭскалацииОшибок</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>ДатаИзмененияСтатуса</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУведомления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерОчереди</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусРеагирования</name>
    <type>
      <types>EnumRef.СтатусыОбработкиЭскалацииОшибок</types>
    </type>
  </attributes>
  <dimensions>
    <name>Направление</name>
    <type>
      <types>CatalogRef.НаправленияРазработки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Система</name>
    <type>
      <types>CatalogRef.СистемыУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерьезностьОшибки</name>
    <type>
      <types>CatalogRef.СерьезностьОшибок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторОчереди</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Enums/СтатусыОбработкиЭскалацииОшибок/СтатусыОбработкиЭскалацииОшибок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОбработкиЭскалацииОшибок</name>
  <enumValues>
    <name>Ожидание</name>
  </enumValues>
  <enumValues>
    <name>Отправлено</name>
  </enumValues>
  <enumValues>
    <name>ЕстьРеакция</name>
  </enumValues>
  <enumValues>
    <name>НетРеакции</name>
  </enumValues>
  <enumValues>
    <name>НеТребуетРеакции</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Documents/ОбработкаЭскалацииОшибок/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ИсторияЭскалацииОшибок.Записывать = Истина;
	
	Для Каждого СтрокаТаблицы Из ОчередьЭскалации Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.СтатусРеагирования)
			И СтрокаТаблицы.СтатусРеагирования <> Перечисления.СтатусыОбработкиЭскалацииОшибок.НеТребуетРеакции Тогда
			
			Движение = Движения.ИсторияЭскалацииОшибок.Добавить();
			Движение.Период = Дата;
			Движение.Направление = Направление;
			Движение.Система = Система;
			Движение.СерьезностьОшибки = СерьезностьОшибки;
			Движение.ИдентификаторОчереди = СтрокаТаблицы.ИдентификаторОчереди;
			Движение.ДатаИзмененияСтатуса = СтрокаТаблицы.ДатаИзмененияСтатуса;
			Движение.ДатаУведомления = СтрокаТаблицы.ДатаУведомления;
			Движение.НомерОчереди = СтрокаТаблицы.НомерСтроки;
			Движение.СтатусРеагирования = СтрокаТаблицы.СтатусРеагирования;
			
			Если СтрокаТаблицы.СтатусРеагирования = Перечисления.СтатусыОбработкиЭскалацииОшибок.Ожидание Тогда
				РегистрыСведений.ОчередьСобытийНаОбработку.ОтправитьОповещениеОчередиЭскалации(Ссылка, СтрокаТаблицы);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
